Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: །ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ཤིན་དུ་རྣམ་པར་དག་པ་ལ་མཚན་མའི་གནས་མེད་དོ། །རབ་འབྱོར་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་བྱང་ཆུབ་སེམས་དཔའི་ཚིག་གི་དོན་མེད་དོ།
en: Subhūti, just as the signs that physical forms are utterly pure are without any basis, and just as the signs that feelings, perceptions, formative predispositions, and consciousness are utterly pure are without any basis, in the same way, Subhūti, the actual entity denoted by the word bodhisattva, in the sense of a bodhisattva great being practicing the perfection of wisdom, is not an actual entity. {

source: །རབ་འབྱོར་འདི་ལྟ་སྟེ་དཔེར་ན། སྐྱེ་མཆེད་དང་། ཁམས་དང་། རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་ཤིན་ཏུ་རྣམ་པར་དག་པ་ལ་མཚན་མའི་གནས་མེད་དོ། །རབ་འབྱོར་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་བྱང་ཆུབ་སེམས་དཔའི་ཚིག་གི་དོན་མེད་དོ། །དྲན་པ་ཉེ་བར་གཞག་པའི་བར་དུ་ཤིན་དུ་རྣམ་པར་དག་པ་ལ་མཚན་མའི་གནས་མེད་དོ། །ཡང་དག་པར་སྤོང་བ་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་དང་། དབང་པོ་དང་། སྟོབས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་རྣམས་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་དང་། འཕགས་པའི་བདེན་པ་རྣམས་དང་། བསམ་གཏན་རྣམས་དང་། ཚད་མེད་པ་རྣམས་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། མངོན་པར་ཤེས་པ་རྣམས་དང་། ཏིང་ངེ་འཛིན་རྣམས་དང་།
en: Dt.163} “Subhūti, just as the signs that the sense fields, the sensory elements, and the links of dependent origination are utterly pure are without any basis, in the same way, Subhūti, the actual entity denoted by the word bodhisattva, in the sense of a bodhisattva great being practicing the perfection of wisdom, is not an actual entity.

source: གཟུངས་ཀྱི་སྒོ་རྣམས་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་ཤིན་དུ་རྣམ་པར་དག་པ་ལ་མཚན་མའི་གནས་མེད་དོ།
en: Just as the signs that the applications of mindfulness are utterly pure are without any basis, and just as the signs that the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, the noble eightfold path, the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the gateways of the meditative stabilities and the dhāraṇīs, the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, and the eighteen distinct qualities of the buddhas are utterly pure are without any basis, in the same way, Subhūti, the actual entity denoted by the word bodhisattva, in the sense of a bodhisattva great being practicing the perfection of wisdom, is not an actual entity. “

source: །རབ་འབྱོར་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་བྱང་ཆུབ་སེམས་དཔའི་ཚིག་གི་དོན་མེད་དོ། །རབ་འབྱོར་འདི་ལྟ་སྟེ་དཔེར་ན། བདག་མེད་པའི་ཕྱིར་བདག་ཤིན་དུ་རྣམ་པར་དག་པ་ལ་མཚན་མའི་གནས་མེད་དོ། །སེམས་ཅན་དང་། སྲོག་དང་། འགྲོ་བ་དང་། གསོ་བ་དང་། སྐྱེས་བུ་དང་། གང་ཟག་དང་། ཤེད་ཅན་དང་། ཤེད་བདག་དང་། བྱེད་པ་པོ་དང་། ཚོར་བ་པོ་དང་། ཤེས་པ་པོ་དང་། མཐོང་བ་པོ་མེད་པའི་ཕྱིར། སེམས་ཅན་དང་། སྲོག་དང་། འགྲོ་བ་དང་། གསོ་བ་དང་། སྐྱེས་བུ་དང་། གང་ཟག་དང་། ཤེད་ཅན་དང་། ཤེད་བདག་དང་། བྱེད་པ་པོ་དང་། ཚོར་བ་པོ་དང་། ཤེས་པ་པོ་དང་། མཐོང་བ་པོ་ཤིན་དུ་རྣམ་པར་དག་པ་ལ་མཚན་མའི་གནས་མེད་དོ།
en: Subhūti, just as the signs that the self is utterly pure are without any basis on account of the nonexistence of self, and just as the signs that sentient beings, life forms, living beings, life, living creatures, individuals, human beings, people, actors, experiencers, knowers, and viewers are utterly pure are without any basis on account of the nonexistence of sentient beings, life forms, living beings, life, living creatures, individuals, human beings, people, actors, experiencers, knowers, and viewers, in the same way, Subhūti, the actual entity denoted by the word bodhisattva, in the sense of a bodhisattva great being practicing the perfection of wisdom, is not an actual entity. “

source: །རབ་འབྱོར་དེ་བཞིན་དུ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་བྱང་ཆུབ་སེམས་དཔའི་ཚིག་གི་དོན་མེད་དོ། །རབ་འབྱོར་འདི་ལྟ་སྟེ་དཔེར་ན། ཉི་མའི་དཀྱིལ་འཁོར་མངོན་པར་འཆར་བའི་ཚེ། མུན་པའི་གནས་མེད་དོ།
en: Subhūti, just as [the notion of] darkness at sunrise is without any basis, in the same way, Subhūti, the actual entity denoted by the word bodhisattva, in the sense of a bodhisattva great being practicing the perfection of wisdom, is not an actual entity.

source: །རབ་འབྱོར་དེ་བཞིན་དུ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་བྱང་ཆུབ་སེམས་དཔའི་ཚིག་གི་དོན་མེད་དོ། །རབ་འབྱོར་འདི་ལྟ་སྟེ་དཔེར་ན། བསྐལ་པའི་མེ་འབར་བའི་ཚེ། འདུ་བྱེད་ཀྱི་རྣམ་པ་ཐམས་ཅད་ཀྱི་གནས་མེད་དོ།
en: Subhūti, just as when the conflagration at the end of an eon occurs, all that is included in conditioned phenomena will be rendered without any basis, in the same way, Subhūti, the actual entity denoted by the word bodhisattva, in the sense of a bodhisattva great being practicing the perfection of wisdom, is not an actual entity. “

source: །རབ་འབྱོར་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་བྱང་ཆུབ་སེམས་དཔའི་ཚིག་གི་དོན་མེད་དོ། །རབ་འབྱོར་འདི་ལྟ་སྟེ་དཔེར་ན། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱི་ཚུལ་ཁྲིམས་ལ། ཚུལ་ཁྲིམས་ངན་པའི་གནས་མེད་དོ།
en: Subhūti, just as degenerate morality in the ethical discipline of the tathāgatas, arhats, completely awakened buddhas is without any basis, in the same way, Subhūti, the actual entity denoted by the word bodhisattva, in the sense of a bodhisattva great being practicing the perfection of wisdom, is not an actual entity.

source: །རབ་འབྱོར་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་བྱང་ཆུབ་སེམས་དཔའི་ཚིག་གི་དོན་མེད་དོ། །རབ་འབྱོར་འདི་ལྟ་སྟེ་དཔེར་ན། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱི་ཏིང་ངེ་འཛིན་ལ་འཁྲུག་པའི་གནས་མེད་དོ། །རབ་འབྱོར་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་བྱང་ཆུབ་སེམས་དཔའི་ཚིག་གི་དོན་མེད་དོ།
en: Subhūti, just as distraction in the meditative stability of the tathāgatas, arhats, completely awakened buddhas is without any basis, in the same way, Subhūti, the actual entity denoted by the word bodhisattva, in the sense of a bodhisattva great being practicing the perfection of wisdom, is not an actual entity.

source: །རབ་འབྱོར་འདི་ལྟ་སྟེ་དཔེར་ན། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱི་ཤེས་རབ་ལ། ཤེས་རབ་འཆལ་པའི་གནས་མེད་དོ། །རབ་འབྱོར་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་བྱང་ཆུབ་སེམས་དཔའི་ཚིག་གི་དོན་མེད་དོ། །རབ་འབྱོར་འདི་ལྟ་སྟེ་དཔེར་ན།
en: Subhūti, just as stupidity in the wisdom of the tathāgatas, arhats, completely awakened buddhas is without any basis, in the same way, Subhūti, the actual entity denoted by the word bodhisattva, in the sense of a bodhisattva great being practicing the perfection of wisdom, is not an actual entity.

source: དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱི་རྣམ་པར་གྲོལ་བ་ལ། རྣམ་པར་མ་གྲོལ་བའི་གནས་མེད་དོ། །རབ་འབྱོར་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་བྱང་ཆུབ་སེམས་དཔའི་ཚིག་གི་དོན་མེད་དོ། །རབ་འབྱོར་འདི་ལྟ་སྟེ་དཔེར་ན།
en: Subhūti, just as nonliberation in the liberation of the tathāgatas, arhats, completely awakened buddhas is without any basis, in the same way, Subhūti, the actual entity denoted by the word bodhisattva, in the sense of a bodhisattva great being practicing the perfection of wisdom, is not an actual entity.

source: དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱི་རྣམ་པར་གྲོལ་བའི་ཡེ་ཤེས་གཟིགས་པ་ལ། རྣམ་པར་གྲོལ་བའི་ཡེ་ཤེས་མ་གཟིགས་པའི་གནས་མེད་དོ། །རབ་འབྱོར་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་བྱང་ཆུབ་སེམས་དཔའི་ཚིག་གི་དོན་མེད་དོ། །རབ་འབྱོར་འདི་ལྟ་སྟེ་དཔེར་ན།
en: Subhūti, just as the nonseeing of the wisdom of liberation wisdom in seeing the wisdom of liberation of the tathāgatas, arhats, completely awakened buddhas is without any basis, in the same way, Subhūti, the actual entity denoted by the word bodhisattva, in the sense of a bodhisattva great being practicing the perfection of wisdom, is not an actual entity. “

source: ཉི་མ་དང་ཟླ་བའི་འོད་ལ་གནས་མེད་དོ། །རབ་འབྱོར་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་བྱང་ཆུབ་སེམས་དཔའི་ཚིག་གི་དོན་མེད་དོ། །རབ་འབྱོར་འདི་ལྟ་སྟེ་དཔེར་ན། གཟའ་དང་།
en: Subhūti, just as the light of the sun and moon is without any basis, in the same way, Subhūti, the actual entity denoted by the word bodhisattva, in the sense of a bodhisattva great being practicing the perfection of wisdom, is not an actual entity. {

source: སྐར་མ་དང་། ནོར་བུ་རིན་པོ་ཆེ་དང་། གློག་གི་འོད་ལ་གནས་མེད་དོ། །རབ་འབྱོར་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་བྱང་ཆུབ་སེམས་དཔའི་ཚིག་གི་དོན་མེད་དོ། །རབ་འབྱོར་འདི་ལྟ་སྟེ་དཔེར་ན། རྒྱལ་ཆེན་བཞིའི་རིས་ཀྱི་ལྷ་རྣམས་ཀྱི་འོད་ལ་གནས་མེད་དོ། །སུམ་ཅུ་རྩ་གསུམ་གྱི་ལྷ་རྣམས་དང་། མཚེ་མ་དང་། དགའ་ལྡན་དང་། འཕྲུལ་དགའ་དང་། གཞན་འཕྲུལ་དབང་བྱེད་དང་། ཚངས་རིས་དང་།
en: Dt.164} Subhūti, just as the light of the planets, stars, gemstones, and lightning bolts is without any basis, in the same way, Subhūti, the actual entity denoted by the word bodhisattva, in the sense of a bodhisattva great being practicing the perfection of wisdom, is not an actual entity.

source: ཚངས་ལྷ་ཉེ་ཕན་དང་། ཚངས་པ་ཀུན་འཁོར་དང་། ཚངས་ཆེན་དང་། འོག་མིན་གྱི་བར་གྱི་ལྷ་རྣམས་ཀྱི་འོད་ལ་གནས་མེད་དོ། །རབ་འབྱོར་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་བྱང་ཆུབ་སེམས་དཔའི་ཚིག་གི་དོན་མེད་དོ།
en: Subhūti, just as the light of the gods of Caturmahā­rāja­kāyika is without any basis, and just as the light of the gods of Trayastriṃśa, Yāma, Tuṣita, Nirmāṇarata, Para­nirmita­vaśa­vartin, Brahmakāyika, Brahmapurohita, Brahma­pariṣadya, Mahābrahmā, and [all the other god realms], up to and including Akaniṣṭha, is without any basis, in the same way, Subhūti, the actual entity denoted by the word bodhisattva, in the sense of a bodhisattva great being practicing the perfection of wisdom, is not an actual entity.

source: །རབ་འབྱོར་འདི་ལྟ་སྟེ་དཔེར་ན། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་འོད་ལ་གནས་མེད་དོ། །དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ཀྱི་འོད་ལ་གནས་མེད་དོ། །རབ་འབྱོར་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་བྱང་ཆུབ་སེམས་དཔའི་ཚིག་གི་དོན་མེད་དོ།
en: Subhūti, just as the light of bodhisattva great beings is without any basis, and just as the light of the tathāgatas, arhats, completely awakened buddhas is without any basis, in the same way, Subhūti, the actual entity denoted by the word bodhisattva, in the sense of a bodhisattva great being practicing the perfection of wisdom, is not an actual entity.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་འདི་ལྟར་བྱང་ཆུབ་གང་ཡིན་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ཚིག་གི་དོན་གང་ཡིན་པའི་ཆོས་དེ་དག་ཐམས་ཅད་ཀྱང་ལྡན་པ་ཡང་མ་ཡིན། མི་ལྡན་པ་ཡང་མ་ཡིན་ཏེ། གཟུགས་མེད་པ།
en: If you ask why, Subhūti, it is because what enlightenment is, what a bodhisattva and the actual entity denoted by the word bodhisattva is, and all such phenomena are neither conjoined nor disjoined, and they are immaterial, impossible to indicate, and unobstructed.

source: བསྟན་དུ་མེད་པ། ཐོགས་པ་མེད་པ། འདི་ལྟར་མཚན་ཉིད་མེད་པར་མཚན་ཉིད་གཅིག་པ་ཤ་སྟག་སྟེ།
en: That is to say, their only defining characteristic is that they are without defining characteristics.

source: རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ཐམས་ཅད་ལ་མ་ཆགས་པ་དང་། མེད་པ་ཡང་དག་པ་ཉིད་ལ་བསླབ་པར་བྱའོ།
en: Subhūti, bodhisattva great beings should train in nonattachment to all phenomena and the fact that they are truly nonexistent.

source: །རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཆོས་ཐམས་ཅད་ལ་རྟོག་པ་མེད་ཅིང་། རྣམ་པར་རྟོག་པ་མེད་པར་ཡང་རིག་པར་བྱའོ། །གསོལ་པ།
en: Subhūti, bodhisattva great beings should know all phenomena, without ideation and without conceptual thoughts.” “

source: བཅོམ་ལྡན་འདས་ཆོས་ཐམས་ཅད་ནི་གང་ལགས། བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཆོས་གང་རྣམས་ཀྱི་མ་ཆགས་པ་དང་མཆིས་པ་མ་ལགས་པ་ཡང་དག་པ་ཉིད་ལ་ཇི་ལྟར་བསླབ་པར་བགྱི།
en: Blessed Lord, what constitutes all phenomena, and, Blessed Lord, what are the phenomena to which bodhisattva great beings should not be attached, and how should they train in the fact that they are truly nonexistent?

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཆོས་ཐམས་ཅད་ནི་གང་རྣམས་རིག་པར་བགྱི། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: What are the phenomena that bodhisattva great beings should know?”

source: རབ་འབྱོར་ཆོས་ཐམས་ཅད་ཅེས་བྱ་བ་ནི་དགེ་བ་དང་མི་དགེ་བ་དང་ལུང་དུ་བསྟན་པ་དང་། ལུང་དུ་མ་བསྟན་པ་དང་། འཇིག་རྟེན་པ་དང་འཇིག་རྟེན་ལས་འདས་པ་དང་། ཟག་པ་དང་བཅས་པ་དང་། ཟག་པ་མེད་པ་དང་། འདུས་བྱས་དང་། འདུས་མ་བྱས་དང་། ཁ་ན་མ་ཐོ་བ་དང་བཅས་པ་དང་།
en: The Blessed One responded, “Subhūti, the expression all phenomena denotes phenomena that are virtuous and nonvirtuous, specific and indeterminate, mundane and supramundane, contaminated and uncontaminated, conditioned and unconditioned, objectionable and free from being objectionable, common and uncommon.

source: ཁ་ན་མ་ཐོ་བ་མེད་པ་དང་། ཐུན་མོང་དང་། ཐུན་མོང་མ་ཡིན་པ་དག་སྟེ། རབ་འབྱོར་དེ་དག་ནི་ཆོས་ཐམས་ཅད་ཅེས་བྱ་སྟེ།
en: Subhūti, these constitute all phenomena. {

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཀྱང་ཆོས་དེ་དག་ཐམས་ཅད་ལ་མ་ཆགས་པ་དང་། མེད་པ་ཉིད་ལ་བསླབ་པར་བྱའོ།
en: Dt.165} Bodhisattva great beings should train in nonattachment to all those phenomena and the fact that they are truly nonexistent.

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་པར་བྱ་བ་ཡང་ཆོས་ཐམས་ཅད་པོ་དེ་དག་ཉིད་དོ། །གསོལ་པ།
en: Those are all the phenomena that bodhisattva great beings should indeed know.” “

source: བཅོམ་ལྡན་འདས་འཇིག་རྟེན་པའི་དགེ་བའི་ཆོས་གང་ལགས། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་འཇིག་རྟེན་པའི་ཆོས་དགེ་བ་ཞེས་བྱ་བ་ནི། ཕར་ཤེས་པ། མར་ཤེས་པ། དགེ་སྦྱོང་དུ་ཤེས་པ། བྲམ་ཟེར་ཤེས་པ། རིགས་ཀྱི་ནང་ན་རྒན་པ་ལ་རིམ་གྲོ་བྱེད་པ་དང་། སྦྱིན་པ་ལས་བྱུང་བའི་བསོད་ནམས་ཀྱི་ལས་ཀྱི་དངོས་པོ་དང་། ཚུལ་ཁྲིམས་ལས་བྱུང་བ་དང་། བསྒོམ་པ་ལས་བྱུང་བའི་བསོད་ནམས་ཀྱི་ལས་ཀྱི་དངོས་པོ་དང་། ཉམས་སུ་བླང་བ་དང་ལྡན་པའི་དངོས་པོ་དང་། དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་རྣམས་དང་། འཇིག་རྟེན་པའི་འདུ་ཤེས་དགུ་སྟེ། འདི་ལྟར་རྣམ་པར་བམ་པའི་འདུ་ཤེས་དང་། འབུ་ཅན་གྱི་འདུ་ཤེས་དང་། རྣམ་པར་རྣགས་པའི་འདུ་ཤེས་དང་། རྣམ་པར་དམར་བའི་འདུ་ཤེས་དང་། རྣམ་པར་སྔོས་པའི་འདུ་ཤེས་དང་། རྣམ་པར་ཟོས་པའི་འདུ་ཤེས་དང་། རྣམ་པར་འཐོར་བའི་འདུ་ཤེས་དང་། རུས་པའི་འདུ་ཤེས་དང་། རྣམ་པར་ཚིག་པའི་འདུ་ཤེས་དང་། འཇིག་རྟེན་པའི་བསམ་གཏན་བཞི་དང་། ཚད་མེད་པ་བཞི་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་བཞི་དང་། མངོན་པར་ཤེས་པ་ལྔ་དང་།
en: Blessed Lord, what phenomena constitute mundane virtuous phenomena?” “

source: འཇིག་རྟེན་པའི་རྗེས་སུ་དྲན་པ་བཅུ་སྟེ། འདི་ལྟར་སངས་རྒྱས་རྗེས་སུ་དྲན་པ་དང་། ཆོས་རྗེས་སུ་དྲན་པ་དང་། དགེ་འདུན་རྗེས་སུ་དྲན་པ་དང་། ཚུལ་ཁྲིམས་རྗེས་སུ་དྲན་པ་དང་། གཏོང་བ་རྗེས་སུ་དྲན་པ་དང་། ལྷ་རྗེས་སུ་དྲན་པ་དང་། དབུགས་ཕྱི་ནང་དུ་རྒྱུ་བ་རྗེས་སུ་དྲན་པ་དང་། ལུས་ཀྱི་རྣམ་པ་རྗེས་སུ་དྲན་པ་དང་།
en: Subhūti,” replied the Blessed One, “mundane virtuous phenomena include the following: respect for one’s father, respect for one’s mother, respect for a virtuous ascetic, respect for a brahmin priest, acts of service undertaken on behalf of elderly family members, meritorious deeds originating from generosity, meritorious deeds originating from ethical discipline and meditation, the merits of those who have meditative experience, the paths associated with the ten virtuous actions, the nine mundane contemplations—namely, contemplation of a bloated corpse, contemplation of a worm-infested corpse, contemplation of a putrefied corpse, contemplation of a bloody corpse, contemplation of a blue-black corpse, contemplation of a devoured corpse, contemplation of a dismembered corpse, contemplation of a skeleton, and contemplation of an immolated corpse—and the four mundane meditative concentrations, the four immeasurable attitudes, the four formless meditative absorptions, the five extrasensory powers, and the ten mundane recollections—namely, recollection of the Buddha, recollection of the Dharma, recollection of the Saṅgha, recollection of ethical discipline, recollection of giving away, recollection of the god realms, recollection of breathing, recollection of the body, recollection of disillusionment, and recollection of death.

source: སྐྱོ་བ་རྗེས་སུ་དྲན་པ་དང་། འཆི་བ་རྗེས་སུ་དྲན་པ་དག་སྟེ། དེ་དག་ནི་འཇིག་རྟེན་པའི་ཆོས་དགེ་བ་ཞེས་བྱའོ།
en: These are observed to be mundane virtuous phenomena.” “

source: །གསོལ་པ། བཅོམ་ལྡན་འདས་འཇིག་རྟེན་པའི་ཆོས་མི་དགེ་བ་གང་ལགས། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, what phenomena constitute mundane nonvirtuous phenomena?” “

source: མི་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་དག་སྟེ། འདི་ལྟར་རབ་འབྱོར་སྲོག་གཅོད་པ་ནི་འཇིག་རྟེན་པའི་ཆོས་མི་དགེ་བའོ། །མ་བྱིན་པར་ལེན་པ་དང་། འདོད་པས་ལོག་པར་གཡེམ་པ་དང་། བརྫུན་དུ་སྨྲ་བ་དང་། ཕྲ་མ་དང་། ཞེ་གཅོད་པ་དང་། ཚིག་ཀྱལ་པ་དང་། ཆགས་སེམས་དང་། གནོད་སེམས་དང་། ལོག་པར་ལྟ་བ་དང་། ཁྲོ་བ་དང་། མདུད་པར་འཛིན་པ་དང་། འཆབ་པ་དང་། འཚིག་པ་དང་། འཚེ་བ་དང་། ཕྲག་དོག་དང་།
en: Subhūti,” replied the Blessed One, “the paths of the ten mundane nonvirtuous phenomena include the following: Subhūti, the killing of living creatures is a mundane nonvirtuous phenomenon, as are theft, sexual misconduct, falsehood, slander, verbal abuse, irresponsible chatter, covetousness, malice, wrong views, anger, enmity, hypocrisy, annoyance, violence, jealousy, miserliness, pride, and perverse pride.

source: སེར་སྣ་དང་། ང་རྒྱལ་དང་། ལོག་པའི་ང་རྒྱལ་སྟེ། རབ་འབྱོར་དེ་དག་ནི་འཇིག་རྟེན་པའི་ཆོས་མི་དགེ་བའོ། །གསོལ་པ།
en: Subhūti, these constitute mundane nonvirtuous phenomena.” “

source: བཅོམ་ལྡན་འདས་ལུང་དུ་མ་བསྟན་པའི་ཆོས་གང་ལགས། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ལུས་ཀྱི་ལས་ནི་ལུང་མ་བསྟན་པའོ། །ངག་གི་ལས་ནི་ལུང་མ་བསྟན་པའོ།
en: Blessed Lord, what phenomena constitute indeterminate phenomena?” “

source: །ཡིད་ཀྱི་ལས་ནི་ལུང་མ་བསྟན་པའོ། །འབྱུང་བ་ཆེན་པོ་བཞི་ནི་ལུང་མ་བསྟན་པའོ། །དབང་པོ་ལྔ་ནི་ལུང་མ་བསྟན་པའོ། །སྐྱེ་མཆེད་དྲུག་ནི་ལུང་མ་བསྟན་པའོ། །གཟུགས་མེད་པ་བཞིར་སྐྱེས་པ་ནི་ལུང་མ་བསྟན་པའོ།
en: Subhūti,” replied the Blessed One, “indeterminate phenomena include the following: indeterminate physical actions, indeterminate verbal actions, indeterminate mental actions, the indeterminate four primary elements, the indeterminate five sense organs, the indeterminate six sense fields, the indeterminate beings born within the four formless realms, the indeterminate psycho-physical aggregates, sensory elements, and sense fields, and all indeterminate maturations [of past actions].

source: །ཕུང་པོ་དང་། ཁམས་དང་། སྐྱེ་མཆེད་ནི་ལུང་མ་བསྟན་པའོ། །རྣམ་པར་སྨིན་པ་ཐམས་ཅད་ནི་ལུང་མ་བསྟན་པ་སྟེ། རབ་འབྱོར་དེ་དག་ནི་ལུང་མ་བསྟན་པའི་ཆོས་སུ་ཤེས་པར་བྱའོ།
en: Subhūti, these are known as indeterminate phenomena.

source: །གསོལ་བ། བཅོམ་ལྡན་འདས་འཇིག་རྟེན་པའི་ཆོས་གང་ལགས། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་འཇིག་རྟེན་པའི་ཆོས་ཞེས་བྱ་བ་ནི། ཕུང་པོ་དང་། སྐྱེ་མཆེད་དང་།
en: ”{Dt.166} “Blessed Lord, what phenomena constitute mundane phenomena?” “

source: ཁམས་དང་། དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་དང་། བསམ་གཏན་བཞི་དང་། ཚད་མེད་པ་བཞི་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་བཞི་དང་། མངོན་པར་ཤེས་པ་ལྔ་དང་།
en: Subhūti,” replied the Blessed One, “mundane phenomena include the following: the psycho-physical aggregates, the sense fields, the sensory elements, the paths of the ten virtuous actions, the four meditative concentrations, the four immeasurable attitudes, the four formless meditative absorptions, the five extrasensory powers, and whatever other mundane phenomena there may be that are not supramundane phenomena.

source: འཇིག་རྟེན་ལས་འདས་པའི་ཆོས་མ་གཏོགས་པར། དེ་མ་ཡིན་པར་འཇིག་རྟེན་པའི་ཆོས་གང་ཇི་སྙེད་པ་དེ་དག་ནི་འཇིག་རྟེན་པའི་ཆོས་ཞེས་བྱའོ།
en: These constitute mundane phenomena.” “

source: །གསོལ་པ། བཅོམ་ལྡན་འདས་འཇིག་རྟེན་ལས་འདས་པའི་ཆོས་གང་ལགས། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་འཇིག་རྟེན་ལས་འདས་པའི་ཆོས་ཞེས་བྱ་བ་ནི། དྲན་པ་ཉེ་བར་གཞག་པ་བཞི་དང་། ཡང་དག་པར་སྤོང་བ་བཞི་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་བཞི་དང་།
en: Blessed Lord, what phenomena constitute supramundane phenomena?” “

source: དབང་པོ་ལྔ་དང་། སྟོབས་ལྔ་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་བདུན་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་དང་། རྣམ་པར་ཐར་པའི་སྒོ་སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་།
en: Subhūti,” replied the Blessed One, “supramundane phenomena include the following: the four applications of mindfulness, the four correct exertions, the four supports for miraculous abilities, the five faculties, the five powers, the seven branches of enlightenment, the noble eightfold path, and the gateways to liberation—emptiness, signlessness, and wishlessness.

source: མ་ཤེས་པ་ཡོངས་སུ་ཤེས་པར་བྱ་བའི་དབང་པོ་དང་། ཡོངས་སུ་ཤེས་པའི་དབང་པོ་དང་། ཡོངས་སུ་ཤེས་པར་རྟོགས་པའི་དབང་པོ་དང་། རྟོག་པ་དང་བཅས་དཔྱོད་པ་དང་བཅས་པའི་ཏིང་ངེ་འཛིན་དང་། རྟོག་པ་མེད་པ་ལ་དཔྱོད་པ་ཙམ་གྱི་ཏིང་ངེ་འཛིན་དང་། རྟོག་པ་མེད་ཅིང་དཔྱོད་པ་མེད་པའི་ཏིང་ངེ་འཛིན་དང་། རིག་པ་དང་།
en: They include the faculties that will enable knowledge of all that is unknown, the faculties that acquire the knowledge of all phenomena, the faculties endowed with the knowledge of all phenomena, the meditative stability endowed with ideation and scrutiny, the meditative stability free from ideation and endowed merely with scrutiny, and the meditative stability devoid of both ideation and scrutiny.

source: རྣམ་པར་གྲོལ་བ་དང་། དྲན་པ་དང་། ཤེས་བཞིན་དང་། ཚུལ་བཞིན་དུ་ཡིད་ལ་བྱ་བ་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དེ།
en: And they include awareness, liberation, recollection, alertness, appropriate attention, and the eight aspects of liberation.

source: བརྒྱད་གང་ཞེ་ན། གཟུགས་དང་ལྡན་པ་གཟུགས་མཐོང་བ་འདི་ནི། རྣམ་པར་ཐར་བ་དང་པོའོ།
en: If you ask what are these eight, the first aspect of liberation ensues when corporeal beings observe physical forms [in order to compose the mind].

source: །ནང་གཟུགས་མེད་པའི་འདུ་ཤེས་དང་ལྡན་པས། ཕྱི་རོལ་གྱི་གཟུགས་མཐོང་བ་འདི་ནི་རྣམ་པར་ཐར་བ་གཉིས་པའོ།
en: The second aspect of liberation ensues when formless beings endowed with internal perception observe external physical forms.

source: །སྡུག་པར་མོས་པར་གྱུར་པ་འདི་ནི་རྣམ་པར་ཐར་པ་གསུམ་པའོ།
en: The third aspect of liberation ensues when beings are inclined toward pleasant states.

source: །གཟུགས་ཀྱི་འདུ་ཤེས་ལས་ཡང་དག་པར་འདས་ཏེ། ཐོགས་པའི་འདུ་ཤེས་རྣམས་ནུབ་པར་གྱུར་ཅིང་། སྣ་ཚོགས་ཀྱི་འདུ་ཤེས་ཡིད་ལ་མི་བྱེད་པས། ནམ་མཁའ་མཐའ་ཡས་སོ་ཞེས་ཏེ། ནམ་མཁའ་མཐའ་ཡས་སྐྱེ་མཆེད་ལ་ཉེ་བར་བསྒྲུབས་ཏེ་གནས་པ་འདི་ནི་རྣམ་པར་ཐར་པ་བཞི་པའོ།
en: The fourth aspect of liberation ensues when the perceptions of physical forms have been completely transcended, the perceptions of obstructed phenomena have subsided, and the mind does not engage with diverse perceptions, so that one achieves and dwells in the sphere of infinite space, thinking, ‘Space is infinite.’

source: །དེ་རྣམ་པ་ཐམས་ཅད་དུ་ནམ་མཁའ་མཐའ་ཡས་སྐྱེ་མཆེད་ལས་ཡང་དག་པར་འདས་ཏེ། རྣམ་པར་ཤེས་པ་མཐའ་ཡས་སོ་ཞེས། རྣམ་ཤེས་མཐའ་ཡས་སྐྱེ་མཆེད་ལ་ཉེ་བར་བསྒྲུབས་ཏེ་གནས་པ་འདི་ནི་རྣམ་པར་ཐར་པ་ལྔ་པའོ།
en: The fifth aspect of liberation ensues when the sphere of infinite space has been completely transcended in all respects, and one achieves and dwells in the sphere of infinite consciousness, thinking, ‘Consciousness is infinite.’

source: །དེ་རྣམ་པ་ཐམས་ཅད་དུ་རྣམ་ཤེས་མཐའ་ཡས་སྐྱེ་མཆེད་ལས་ཡང་དག་པར་འདས་ཏེ། ཅུང་ཟད་མ་ཡོད་དོ་ཞེས། ཅུང་ཟད་མེད་པའི་སྐྱེ་མཆེད་ལ་ཉེ་བར་བསྒྲུབས་ཏེ་གནས་པ་འདི་ནི་རྣམ་པར་ཐར་པ་དྲུག་པའོ།
en: The sixth aspect of liberation ensues when the sphere of infinite consciousness has been completely transcended in all respects, and one achieves and dwells in the sphere of nothing-at-all, thinking, ‘There is nothing at all.’ {

source: །དེ་རྣམ་པ་ཐམས་ཅད་དུ་ཅུང་ཟད་མེད་པའི་སྐྱེ་མཆེད་ལས་ཡང་དག་པར་འདས་ཏེ། འདུ་ཤེས་མེད་འདུ་ཤེས་མེད་མིན་སྐྱེ་མཆེད་ལ་ཉེ་བར་བསྒྲུབས་ཏེ་གནས་པ་འདི་ནི་རྣམ་པར་ཐར་པ་བདུན་པའོ།
en: Dt.167} The seventh aspect of liberation ensues when the sphere of nothing-at-all has been completely transcended in all respects, and one achieves and dwells in the sphere of neither perception nor nonperception.
